# SetBackground Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..SetBackground Method
View Class See Also
---
Sets the background for the view. Background can only be set for 3d views and for Sections/Elevations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetBackground(
	ViewDisplayBackground background
)
```

Visual Basic
---
```text
Public Sub SetBackground ( _
	background As ViewDisplayBackground _
)
```

Visual C++
---
```text
public:
void SetBackground(
	ViewDisplayBackground^ background
)
```

# ### Parameters
background
    Type: Autodesk.Revit.DB..::..ViewDisplayBackground Background to set. See 'ViewDisplayBackground' class and its 'create' methods.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The background object is invalid, or view has 'Rendering' style. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This view does not contain display-related properties. |

# See Also
View Class
Autodesk.Revit.DB Namespace